src/Documents/Расш1_ОтгрузкаФакт/Расш1_ОтгрузкаФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расш1_ОтгрузкаФакт</name>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОВодителя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПалетМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Расш1_СтатусОтгрузкаФакт</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправленно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактПалетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГСМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АмортизацияТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГСМРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КМСырье</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоШтук</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиРасходыТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьНаемнойМашины</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыСырье</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧасыГелиос</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГСМГелиос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КМГелиос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПростоя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заезд</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Выезд</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧОрдер</name>
    <attributes>
      <name>ЗаказКлиента</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>ТК</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТарифПлан2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТарифФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТарифФакт2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПалет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Возврат</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧОтгрузка</name>
    <attributes>
      <name>Отгрузка</name>
      <type>
        <types>DocumentRef.РасходныйОрдерНаТовары</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Приобретение</name>
    <attributes>
      <name>ПоступлениеУслуг</name>
      <type>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Движение</name>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачальноеПоложение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонечноеПоложение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоординатыСтарт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоординатыСтоп</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Расш1_ОтгрузкаФакт/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 

		
КонецПроцедуры 

 Процедура ПоискДублейСтрокВТабЧасти(ТЧ, Отказ) Экспорт

 КонецПроцедуры

 Процедура ПриЗаписи(Отказ)
	 
	 ТаблЗнач = ТЧОрдер.Выгрузить();
	 Отбор = Новый Структура();
	 
	 Для каждого Стр Из ТаблЗнач Цикл
		 Отбор.Очистить();
		 Для каждого Колонки Из ТаблЗнач.Колонки Цикл
			 Если Колонки.Имя <> "НомерСтроки" Тогда
				 Отбор.Вставить(Колонки.Имя, Стр[Колонки.Имя]);
			 КонецЕсли;
		 КонецЦикла;
		 
		 Строки = ТаблЗнач.НайтиСтроки(Отбор);
		 Если Строки.Количество() > 1 Тогда
			 Для каждого НайденныеСтроки Из Строки Цикл
				 Если Строки.Найти(НайденныеСтроки) > 0 Тогда
					 СтрокаСообщения = "Строка № " + Строки[0].НомерСтроки + " совпадает со строкой № " + НайденныеСтроки.НомерСтроки;
					 Сообщить("Уберите задвоения строк!" + Строка(СтрокаСообщения)); 
					 Отказ = Истина;
					 
				 КонецЕсли;
			 КонецЦикла;
		 КонецЕсли;
	 КонецЦикла;
	 
	 ОтборП = Новый Структура; 
	 ОтборП.Вставить("Возврат",Истина);
	 СтрокиЗ = ТЧОрдер.НайтиСтроки(ОтборП);
	 М = Новый Массив;
	 М.Очистить();
	 Если СтрокиЗ.Количество() >= 1 Тогда
		 
		 Для сч=0 по СтрокиЗ.Количество()-1 Цикл
			 М.Добавить(Строка(СтрокиЗ[сч].ЗаказКлиента.Номер));
		 КонецЦикла;
	 КонецЕсли; 
	 
	 Если М.Количество() > 0 Тогда
		 ОтправитьУведомление(М,ЭтотОбъект.Номер);
	 КонецЕсли;
	 
 
 КонецПроцедуры 
 
 Процедура ОтправитьУведомление(Мас,Номер)
	Почта = Новый ИнтернетПочта; 
	Письмо = Новый ИнтернетПочтовоеСообщение;
	ТекстПисьма = "Добрый день!"+Символы.ПС;
	ТекстПисьма = ТекстПисьма + "По документу отгрузка факт номер " + Строка(Номер) +Символы.ПС;
	ТекстПисьма = ТекстПисьма +" Возвраты по заказам :" +Символы.ПС;
	Для стр=0 по Мас.Количество()-1 Цикл
		ТекстПисьма = ТекстПисьма + "№ " + Мас[стр] + Символы.ПС; 
	КонецЦикла; 
	Текст = Письмо.Тексты.Добавить(ТекстПисьма); 
	Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	Письмо.Тема = Строка(Строка("Возврат на склада готовой продукции") );
	Письмо.Отправитель = "1c@smartbar.ru"; 
	Письмо.ИмяОтправителя = "Отгрузка";
	//emailto = "igor.potemkin33@yandex.ru";
	emailto = "logist@smartbar.ru";
	//emailto = емаил;
	Письмо.Получатели.Добавить(emailto);
	Попытка 
		Почта.Подключиться(ПолучитьПрофильПочты()); 
		Почта.Послать(Письмо); 		
	Исключение 
		Сообщить(ОписаниеОшибки());	
	КонецПопытки;
	Почта.Отключиться(); 
	Письмо.Вложения.Очистить();
	
КонецПроцедуры

 Функция ПолучитьПрофильПочты()
	 
	Профиль = Новый ИнтернетПочтовыйПрофиль; 
	Профиль.АдресСервераSMTP = "smtp.mail.ru";
	Профиль.АдресСервераPOP3 = "pop.mail.ru";
	Профиль.ПортPOP3 = 995;
	Профиль.ПортSMTP = 465; 
	Профиль.Пользователь = "1c@smartbar.ru"; 
	Профиль.Пароль = "GrKV5YLckkiM5AsF8Byt"; 
	Профиль.ПользовательSMTP =  "1c@smartbar.ru"; 
	Профиль.ПарольSMTP = "GrKV5YLckkiM5AsF8Byt"; 
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
	Профиль.ИспользоватьSSLPOP3 = Истина;
	Профиль.ИспользоватьSSLSMTP = Истина;  

	Возврат Профиль;
КонецФункции 

 Процедура ПриКопировании(ОбъектКопирования)
	 Отправленно = Ложь;
	 Статус = Неопределено; 
	 ТчОрдер.Очистить();
 КонецПроцедуры
